In [1]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
data = [4, 8, 15, 16, 23, 42]

In [5]:
series = pd.Series(data)

In [12]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
# Ans: A DataFrame in Pandas is a two-dimensional, tabular data structure with labeled rows and columns, capable of holding different data types across columns. In contrast, a Series is a one-dimensional, labeled array that holds a single column of data. The key difference is that a DataFrame can contain multiple columns, whereas a Series represents a single column of data.

In [14]:
data2 = {
    'Name': ['dipak', 'sudh', 'kumar'],
    'Age': [25, 30, 27],
    'Gender': ['male', 'Male', 'male']
}

In [16]:
df2 = pd.DataFrame(data)

In [17]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
ages = pd.Series([25, 30, 27], index=['dipak', 'sudh', 'kumar'], name='Age')

In [19]:
ages

dipak    25
sudh     30
kumar    27
Name: Age, dtype: int64

In [20]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

# Ans:head()
# tail()
# info()
# desc()

In [21]:
# example of tail()

In [26]:
df2.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [27]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# Ans: Series, DataFrame, and Panel are all mutable in nature

In [28]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [29]:
fruits = pd.Series(['Apple', 'Banana', 'Cherry'])
quantities = pd.Series([10, 20, 30])
prices = pd.Series([0.5, 0.2, 0.75])

In [30]:
data3 = {
    'Fruit': fruits,
    'Quantity': quantities,
    'Price': prices
}

In [31]:
df3 = pd.DataFrame(data)

In [32]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female